koson/hydroponics/pH_Controller-master/pH_Controller-master/Firmware/pHDoser/dspic30_c_template_1.X/main.c
/******************************************************************************/
/* Files to Include                                                           */
/******************************************************************************/

/* Device header file */
#if defined(__XC16__)
    #include <xc.h>
#elif defined(__C30__)
    #if defined(__dsPIC30F__)
        #include <p30Fxxxx.h>
    #endif
#endif

// DS1820
#define DQ       PORTFbits.RF2
#define DQ_DIR   TRISFbits.TRISF2



#include <stdint.h>        /* Includes uint16_t definition                    */
#include <stdbool.h>       /* Includes true/false definition                  */
#include <stdio.h>
#include <stdlib.h>
#include <math.h>
#include "system.h"        /* System funct/params, like osc/peripheral config */

#include "uart.h"
#include <libpic30.h>
#include <float.h>
#include "lcd16x2.h"
#include "timer.h"
#include "adc10.h"
#include "qei.h"
#include "eeprom.h"
#include "i2c.h"
#include "ds1820.h"

//_FOSC(CSW_FSCM_OFF & FRC_PLL16)
_FOSC(CSW_FSCM_OFF & XT_PLL16)
_FWDT(WDT_OFF)        
_FBORPOR(PWRT_OFF & PBOR_OFF & MCLR_EN)        
        

/******************************************************************************/
/* Global Variable Declaration                                                */
/******************************************************************************/
unsigned int packet[25];

char buf[30];
// ADC
unsigned int  adc_buff;										// ADC Result
unsigned int  adc_count;

unsigned int pH4_cal;
unsigned int pH7_cal;

int sensor_sim=0;
int sensor_menu=0;

float pH_old_control;
float EC_old_control;

float pH_old;
float pH_read;
float pH_diff;
float pH_old;
float pH_ADC;
float pH_SP=6.0;
float pH_LowSP=5.5;
float pH_HighSP=6.1;
int pHCalStatus;
float pH_Compensate;
int pH_flag=0;
float pH_FeedCount=0;
float pHCoeff=0;
int control_mode;
float tempCoeff_buff;
int pHFeedStatus=0;

volatile float pH_diff_cal;

int EC_flag=0;	 
float EC_diff;
int EC_sign;      
float EC_read;
float EC_adc;
float EC_raw;
float EC_SP=1.5;
float EC_LowSP=1.4;
float EC_HighSP=2.0;
int EC_temp=0;
int EC_CalStatus;
float EC_Cal1413;
int EC_tempOld;
float EC_readOld;

//Alarm
int alarm_mode;

// Timer
int ph_minute;
int ph_second;
int ph_mille_sec;
int data_blink;

int pH_TimeInterval=2;
int EC_TimeInterval=5;
int ph_dose_time;
int ec_dose_time;
int menu_reset_min;
int menu_reset_sec;
int cal_status;
int debug_mode;

int menu_count=0;



/* RELAY */
#define RY1_DIR   TRISDbits.TRISD0
#define RY1       LATDbits.LATD0

/* ENCODER */
#define ENC_TRIS    TRISBbits.TRISB3
#define ENC_A       TRISBbits.TRISB4
#define ENC_B       TRISBbits.TRISB5
#define ENC_SW      PORTBbits.RB3

void init_uart();

void __attribute__((interrupt, no_auto_psv)) _T1Interrupt(void)   // Timer 0.1 s Base
{
	if(pH_TimeInterval != 0)
        ph_mille_sec++;

    if(ph_mille_sec == 5)
	{
		data_blink++;      
    }
	else if(ph_mille_sec == 10)
	{
		ph_mille_sec = 0;
		ph_second++;      
    }
   
    
	_T1IF = 0;  // Clear Timer1 Interrupt flag
}



void Timer1_Init(void)
{
    // Timer
    //Fcy = 80000000 / 4 = 20000000
    // 1 instrunction = 1 / 20000000 = 0.05 uS
    // Overflow every 0.05 uS
    // if 0.1 second = 2000000 instruction 
    // Prescale 1:256 = 2000000 / 256 = 7812
    
    T1CONbits.TON = 0; // Disable Timer
    T1CONbits.TCS = 0; // Select internal instruction cycle clock
    T1CONbits.TGATE = 0; // Disable Gated Timer mode
    T1CONbits.TCKPS = 0b10; // Select 1:1 Prescaler
    T1CONbits.TCKPS = 3; // Select 1:256 Prescaler
    TMR1 = 0x00; // Clear timer register
    PR1 = 11489; // Load the period value
    //PR1 = 7812; // Load the period value 100 mS
    IPC0bits.T1IP = 0x01; // Set Timer1 Interrupt Priority Level
    IFS0bits.T1IF = 0; // Clear Timer1 Interrupt Flag
    IEC0bits.T1IE = 1; // Enable Timer1 interrupt
    T1CONbits.TON = 1; // Start Timer
}

void timer1_reset(void){
  ph_second = 0;
  ph_minute = 0;   
  TMR1 = 0x00;
}

void adc_init()
{
unsigned int Channel, PinConfig, Scanselect, Adcon3_reg, Adcon2_reg,Adcon1_reg;
                ADCON1bits.ADON = 0;                    			// Turn off ADC     
                Channel = ADC_CH0_POS_SAMPLEA_AN0 &					// Channel 0 positive input select AN0         
                          ADC_CH0_NEG_SAMPLEA_NVREF ;             	// Channel 0 negative VREF

                SetChanADC10(Channel);                               // Set channel configuration             
                ConfigIntADC10(ADC_INT_DISABLE);                     // Disable interrupt for ADC
                PinConfig = ENABLE_AN0_ANA ;                         // Enable AN0 analog port                                          
                Scanselect = SKIP_SCAN_AN6 &                         // Scan for AN0-AN3
                             SKIP_SCAN_AN7 &						 // Skip Scan for AN4-A7
                             SKIP_SCAN_AN8 &
                             SKIP_SCAN_AN9;                                                              
                Adcon3_reg = ADC_SAMPLE_TIME_1 &                 	// Sample for 10 time
                             ADC_CONV_CLK_INTERNAL_RC &             // Internal Clock
                             ADC_CONV_CLK_Tcy; 
                Adcon2_reg = ADC_VREF_AVDD_AVSS &                   // Vref at Vdd and Vss
                             ADC_SCAN_ON &                          // Enable scan for ADC
                             ADC_ALT_BUF_OFF &                      // Disable alternate buffer
                             ADC_ALT_INPUT_OFF &                    // Disable alternate input
                             ADC_CONVERT_CH0&                       // Select CH0 convert         
                             ADC_SAMPLES_PER_INT_16;                // 16 sample between interrupt
                Adcon1_reg = ADC_MODULE_ON &                        // Enable module ADC
                             ADC_IDLE_CONTINUE &                    // ADC run on idle mode
                             ADC_FORMAT_INTG &                      // Output value integer format
                             ADC_CLK_MANUAL &                       // ADC manual clock
                             ADC_SAMPLE_SIMULTANEOUS &              // ADC sampling simultaneous
                             ADC_AUTO_SAMPLING_ON;                  // ADC auto sampling    
                    
OpenADC10(Adcon1_reg, Adcon2_reg,Adcon3_reg,PinConfig, Scanselect);  // Turn on ADC module     
}

void pH_Read()
{
	int k;
	float temp2=0;	

	for(k=1;k<=10000;k++)  // Low pass
	{
		ADCON1bits.SAMP = 1;                            
        ConvertADC10();                 				
        temp2 = temp2 + ReadADC10(0);                    
	}
  		pH_ADC =  temp2/10000;
		//pH_read = ((temp2/5000) * pHCoeff) + 0.6;	
		pH_read = ((temp2/10000) * pHCoeff)+pH_Compensate;	
		
		if((pH_read < 0) || (pH_read > 255) )
			pH_read = 0;
}

void Init_QEI(void)
{ 
 //QEI configuration register 
  POSCNT = 0;               // Set Current Position 
  MAXCNT = 904;              // Use QEI in 2x mode
 
  QEICONbits.QEIM = 7;           // x4 reset by MAXCNT pulse
  QEICONbits.POSRES = 0;         // doesn't Allow Index pulse to reset counter
  QEICONbits.SWPAB = 0;          // direction    
}

void feed_acid()
{
if(pH_read > 0.0f && pH_read < 255.0f)
	RY1 = 0;
}
void stop_acid()
{
if(pH_read > 0.0f && pH_read < 255.0f)
	RY1 = 1;
}


void pH_Control()
{
			if( (pH_read*10) == (pH_SP*10))
			{
				pH_flag = 1;
				RY1 = 0; // Relay OFF
			}
			else if( (pH_read*10) > (pH_SP*10) && (pH_flag == 0) )
			{
				RY1 = 1; // Relay ON
				pH_flag = 0;
                pH_FeedCount = pH_FeedCount+((float)ph_dose_time * 8.33); // pump feed @ 500ml/min = 8.33 ml/sec
			}
			else if( (pH_read*10) > (pH_HighSP*10) && (pH_flag == 1) )
			{
				RY1 = 1; // Relay ON
				pH_flag = 0;
                pH_FeedCount = pH_FeedCount+((float)ph_dose_time * 8.33); // pump feed @ 500ml/min = 8.33 ml/sec
			}
			else if((pH_read*10) <= (pH_LowSP*10)) // Lower limit alarm system
			{
				RY1 = 0; // Relay OFF
				pH_flag = 1;
			}
}

/******************************************************************************/
/* Main Program                                                               */
/******************************************************************************/

int main(void)
{

