koson/hydroponics/pH_Controller-master/pH_Controller-master/Firmware/pHDoser/dspic30_c_template_1.X/main.c
    ADPCFG = 0xFFFF;  // Set PORTB Digital input
    RY1_DIR = 0;
    ENC_TRIS = 1;
    ENC_A = 1;
    ENC_B = 1;
    
    LCDInit();
    LCDClrscr();      // Clear screen
    
    adc_init();
    Init_QEI();
    init_uart();

    ph_minute = 0;
    ph_second = 0; 
    ph_mille_sec = 0;

    int menu = 1;
    
    ph_dose_time = 3;
    int aa;
    
    // Load data from EEPROM
    pH_SP = Eeprom_ReadWord(0);	
    pH_SP = (float)pH_SP/10;
    __delay_ms(10);
    pH_LowSP = Eeprom_ReadWord(1);
    pH_LowSP = (float)pH_LowSP/100;
    __delay_ms(10);
    pH_HighSP = Eeprom_ReadWord(2);
    pH_HighSP = (float)pH_HighSP/100;
    __delay_ms(10);
    pH4_cal = Eeprom_ReadWord(3);
    __delay_ms(10);
    pH7_cal = Eeprom_ReadWord(4);
    __delay_ms(10);
    ph_dose_time = Eeprom_ReadWord(5);	
    __delay_ms(10);
    pH_TimeInterval = Eeprom_ReadWord(6);
    __delay_ms(10);
    EC_SP = Eeprom_ReadWord(7);		
    EC_SP = (float)EC_SP/10;
    __delay_ms(10);
    EC_LowSP = Eeprom_ReadWord(8);	
    EC_LowSP = (float)EC_LowSP/100;
    __delay_ms(10);
    EC_HighSP = Eeprom_ReadWord(9);	
    EC_HighSP = (float)EC_HighSP/100;
    __delay_ms(10);
    EC_Cal1413 = Eeprom_ReadWord(10);		
    __delay_ms(10);
    ec_dose_time = Eeprom_ReadWord(11);
    __delay_ms(10);
    EC_TimeInterval = Eeprom_ReadWord(12);	
    __delay_ms(10);


    // For debug
    //pH4_cal = 152;
    //pH7_cal = 435;
    /*pH_SP = 6.0;
    pH_LowSP = 5.8;
    pH_HighSP = 6.2;
    pH_TimeInterval = 1;
    ph_dose_time = 3;*/
    
    if(pH4_cal == -1)
        pH4_cal = 334;
    if(pH7_cal == -1)
        pH7_cal = 390;

    pHCoeff = (3 / (float) (pH7_cal-pH4_cal));
    pH_Compensate = 4-(pH4_cal*pHCoeff);

    if(ph_dose_time <= 0)
        ph_dose_time = 5;
    if(ec_dose_time <= 0)
        ec_dose_time = 5;

    // Initial
     sprintf(buf,"Bearing Hydroponics"); 
     LCDPrintxy(1,1,0, buf);
     sprintf(buf," pHIoT  V.1.4 "); 
     LCDPrintxy(1,2,0, buf);      // Display second
     __delay_ms(2000);

     sprintf(buf,"Firmware ver.1.4 "); 
     LCDPrintxy(1,1,0, buf);
     sprintf(buf,"Update  29/03/17  "); 
     LCDPrintxy(1,2,0, buf);      // Display second
     __delay_ms(2000);

    // Show data for calibration
     sprintf(buf,"pH4=%d pH7=%d",pH4_cal,pH7_cal); 
     LCDPrintxy(1,1,0, buf);
     sprintf(buf,"SP=%.1f m=%f",pH_SP,pHCoeff); 
     LCDPrintxy(1,2,0, buf);      // Display second
     __delay_ms(2000);
 
    Timer1_Init();
    
    float temperature_read;

ds1820_init();

unsigned int *temp_read;

int aa_test=0;

    while(1)
    {
        
        if(pH_FeedCount>9999)
            pH_FeedCount = 0;
        
         pH_Read();
         temp_read = readt();
    
        temperature_read = ((temp_read[1]*256)+temp_read[0])/16;
        
        if(temperature_read > 99)
            temperature_read = 0;
        
        if(pH_read > 14)
            pH_read = 0;
        
        //if(pH_read*10 < 10 && (int)temperature_read > 9)
       // {
            sprintf(buf,"A%2.1fB%2dC%dD\r\n",pH_read,(int)temperature_read,(int)pH_FeedCount);
            putsUART1(buf);
          
           
       // }
        

        
        //__delay_ms(200);
        
         // Timer calculation
		 if(ph_second > 59)
		 {
		 	ph_second = 0;
		 	ph_minute++;
		 }
		 if(ph_minute > 59)
		 {
		 	ph_second = 0;
		 	ph_minute = 0;
		 }	
        
        
        if((ph_minute == pH_TimeInterval) && (ph_second == 0)) 
		{
		    pH_Control();
		}
		if(ph_minute == pH_TimeInterval && ph_second == ph_dose_time) 
	 	{	 
			RY1 = 0;
			ph_second = 0;
		 	ph_minute = 0;
		 	//if(pH_flag == 0)
		 	
	 	}
        //menu_count = POSCNT;


        if(POSCNT >=0 && POSCNT <= 3) 
        {
              if((ph_second % 2) == 0)
              sprintf(buf,"pH    : %2.1f    .",pH_read); 
            else
              sprintf(buf,"pH    : %2.1f     ",pH_read); 
                  
		      LCDPrintxy(1,1,0, buf);
			  sprintf(buf,"Temp. : %2d %cC   ",(int)temperature_read,223);              
			  LCDPrintxy(1,2,0, buf);      // Display second

            /*if(alarm_mode == 1)  // pH Alarm
            {
                sprintf(buf,">>> pH = %1.1f <<<",pH_read); 
                LCDPrintxy(1,1,0, buf);
                sprintf(buf,"Lower than limit"); 
                LCDPrintxy(1,2,0, buf);      // Display second
                delay_ms(200);
                LCD_Command(0x01);      // clear screen lcd
                delay_ms(200);
            }
        }*/

        }// show read data menu
        
        if(POSCNT >=4 && POSCNT <= 7) 
        {
             sprintf(buf,"   pH Setting   "); 
             LCDPrintxy(1,1,0, buf);      // Display second
             sprintf(buf,"Setpoint : %.1f  ",pH_SP); 
             LCDPrintxy(1,2,0, buf);      // Display second
            if(!ENC_SW)
            {
                __delay_ms(250);
                POSCNT = pH_SP*40;
              while(ENC_SW)
              {
                  pH_SP=(float)POSCNT/40;
                  if(POSCNT<220)
                      POSCNT = 220;
                  if(POSCNT>400)
                      POSCNT = 400;
                  
                  if(pH_SP<= 5.5)
                      pH_SP = 5.5;
                  else if(pH_SP>= 10)
                      pH_SP = 10;


                  if(ph_mille_sec%2) // Blink data
                  {
                    sprintf(buf,"   pH Setting   "); 
                    LCDPrintxy(1,1,0, buf);      // Display second
                    sprintf(buf,"Setpoint : %.1f  ",pH_SP); 
                    LCDPrintxy(1,2,0, buf);      // Display second
                  }
                  else
                  {
                    sprintf(buf,"   pH Setting   "); 
                    LCDPrintxy(1,1,0, buf);      // Display second
                    sprintf(buf,"Setpoint :      "); 
                    LCDPrintxy(1,2,0, buf);      // Display second
                  }
              }
              Eeprom_WriteWord(0,(int)(pH_SP*10));
            __delay_ms(10);  
            Eeprom_WriteWord(0,(int)(pH_SP*10));
            __delay_ms(10);  
            }
        }// pH setting menu
        
        if(POSCNT >=8 && POSCNT <= 11)  // pH set Lower Limit
        {
          sprintf(buf,"  pH Low Limit  "); 
          LCDPrintxy(1,1,0, buf);      // Display second
          sprintf(buf,"Setpoint : %.1f  ",pH_LowSP); 
          LCDPrintxy(1,2,0, buf);      // Display second
          
 
