koson/hydroponics/pH_Controller-master/pH_Controller-master/Firmware/pHDoser/dspic30_c_template_1.X/main.c
            if(!ENC_SW)
            {
                __delay_ms(250);
                POSCNT = pH_LowSP*40;
              while(ENC_SW)
              {
                  pH_LowSP=(float)POSCNT/40;
                  if(POSCNT<220)
                      POSCNT = 220;
                  if(POSCNT>pH_SP*40)
                      POSCNT = pH_SP*40;
                  
                  if(pH_LowSP<= 5.5)
                      pH_LowSP = 5.5;
                  else if(pH_LowSP>= pH_SP)
                      pH_LowSP = pH_SP-0.1;



                  if(ph_mille_sec%2) // Blink data
                  {
                    sprintf(buf,"  pH Low Limit  "); 
                    LCDPrintxy(1,1,0, buf);      // Display second
                    sprintf(buf,"Setpoint : %.1f  ",pH_LowSP); 
                    LCDPrintxy(1,2,0, buf);      // Display second
                  }
                  else
                  {
                    sprintf(buf,"  pH Low Limit  "); 
                    LCDPrintxy(1,1,0, buf);      // Display second
                    sprintf(buf,"Setpoint :      ",pH_LowSP); 
                    LCDPrintxy(1,2,0, buf);      // Display second
                  }
              }
              Eeprom_WriteWord(1,(int)(pH_LowSP*100));
            __delay_ms(10);  
             Eeprom_WriteWord(1,(int)(pH_LowSP*100));
            __delay_ms(10);  
            }
        }
        if(POSCNT >=12 && POSCNT <= 15)  // pH set Higher Limit
        {
          sprintf(buf," pH High Limit  "); 
          LCDPrintxy(1,1,0, buf);      // Display second
          sprintf(buf,"Setpoint : %.1f  ",pH_HighSP); 
          LCDPrintxy(1,2,0, buf);      // Display second

            if(!ENC_SW)
            {
                __delay_ms(250);
                POSCNT = pH_HighSP*40;
              while(ENC_SW)
              {
                  pH_HighSP=(float)POSCNT/40;
                  if(POSCNT<pH_SP*40)
                      POSCNT = pH_SP*40;
                  if(POSCNT>400)
                      POSCNT = 400;
                  
                  if(pH_HighSP<= pH_SP)
                      pH_HighSP =pH_SP+0.1;
                  else if(pH_HighSP >= 10)
                      pH_HighSP = 10;


                  if(ph_mille_sec%2) // Blink data
                  {
                    sprintf(buf,"  pH High Limit ");
                    LCDPrintxy(1,1,0, buf);      // Display second
                    sprintf(buf,"Setpoint : %.1f  ",pH_HighSP); 
                    LCDPrintxy(1,2,0, buf);      // Display second
                  }
                  else
                  {
                    sprintf(buf,"  pH High Limit "); 
                    LCDPrintxy(1,1,0, buf);      // Display second
                    sprintf(buf,"Setpoint :      ",pH_HighSP); 
                    LCDPrintxy(1,2,0, buf);      // Display second
                  }
              }
              Eeprom_WriteWord(2,(int)(pH_HighSP*100));
              __delay_ms(10);
              Eeprom_WriteWord(2,(int)(pH_HighSP*100));
              __delay_ms(10);  
            }
        }
        if(POSCNT >=16 && POSCNT <= 19)  // pH Dose Time
        {
           sprintf(buf,"  pH Dose Time  "); 
           LCDPrintxy(1,1,0, buf);
           sprintf(buf," Time : %2d Sec  ",ph_dose_time); 
           LCDPrintxy(1,2,0, buf);  

            if(!ENC_SW)
            {
                __delay_ms(250);
                POSCNT = ph_dose_time*10;
              while(ENC_SW)
              {
                  ph_dose_time=(float)POSCNT/10;
                  if(POSCNT<=0)
                      POSCNT = 0;
                  if(POSCNT>=900)
                      POSCNT = 900;
                  
                  if(ph_dose_time <= 0)
                      ph_dose_time = 0 ;
                  if(ph_dose_time >= 90)
                      ph_dose_time = 90 ;


                  if(ph_mille_sec%2) 
                  {
                    sprintf(buf,"  pH Dose Time  ");
                    LCDPrintxy(1,1,0, buf);   
                    sprintf(buf," Time : %2d Sec  ",ph_dose_time); 
                    LCDPrintxy(1,2,0, buf);   
                  }
                  else
                  {
                    sprintf(buf,"  pH Dose Time  "); 
                    LCDPrintxy(1,1,0, buf);   
                    sprintf(buf," Time :    Sec ",ph_dose_time); 
                    LCDPrintxy(1,2,0, buf);   
                  }
              }
              Eeprom_WriteWord(5,(int)(ph_dose_time));            
            __delay_ms(10);  
            }
        }
        if(POSCNT >=20 && POSCNT <= 23)  // pH Interval Time
        {
           sprintf(buf,"   pH Interval  "); 
           LCDPrintxy(1,1,0, buf);
           sprintf(buf," Time : %2d Min. ",pH_TimeInterval); 
           LCDPrintxy(1,2,0, buf);  

            if(!ENC_SW)
            {
                __delay_ms(250);
                POSCNT = pH_TimeInterval*10;
              while(ENC_SW)
              {
                  pH_TimeInterval=(float)POSCNT/10;
                   if(POSCNT<=0)
                      POSCNT = 0;
                  if(POSCNT>=900)
                      POSCNT = 900;
                  
                  if(pH_TimeInterval <= 0)
                      pH_TimeInterval = 0 ;
                  if(pH_TimeInterval >= 90)
                      pH_TimeInterval = 90 ;


                  if(ph_mille_sec%2) 
                  {
                    sprintf(buf,"   pH Interval  "); 
                    LCDPrintxy(1,1,0, buf);
                    sprintf(buf," Time : %2d Min. ",pH_TimeInterval); 
                    LCDPrintxy(1,2,0, buf);  
                  }
                  else
                  {
                    sprintf(buf,"   pH Interval  "); 
                    LCDPrintxy(1,1,0, buf);
                    sprintf(buf," Time :    Min. "); 
                    LCDPrintxy(1,2,0, buf);    
                  }
              }
              Eeprom_WriteWord(6,(int)(pH_TimeInterval));            
            __delay_ms(10);  
            }
        }
         if(POSCNT >=24 && POSCNT <= 27)  // pH4 Cal
         {
            timer1_reset();			
        
               //pHCalStatus
		      sprintf(buf,"   pH 4  Cal.   "); 
		      LCDPrintxy(1,1,0, buf);
			  sprintf(buf,"  Press  Enter  "); 
			  LCDPrintxy(1,2,0, buf);      // Display second	 	
			  int cal4_cnt;
               if(!ENC_SW)
              {       
                    for(cal4_cnt=60;cal4_cnt>0;cal4_cnt--)
                    {
                        __delay_ms(1000); 
                        sprintf(buf,"   pH 4  Cal.   "); 
                        LCDPrintxy(1,1,0, buf);
                        sprintf(buf," Time Left %d ",cal4_cnt); 
                        LCDPrintxy(1,2,0, buf);      // Display second
                    }
                   Eeprom_WriteWord(3,(int)(pH_ADC));                    
                   __delay_ms(10);
                    Eeprom_WriteWord(3,(int)(pH_ADC));  
                   __delay_ms(10);
                    pH4_cal = pH_ADC;
              }

       }//pH 4 Calibration
	
        if(POSCNT >=28 && POSCNT <= 31)  // pH7 Cal
        {
            timer1_reset();			
        
               //pHCalStatus
		      sprintf(buf,"   pH 7  Cal.   "); 
		      LCDPrintxy(1,1,0, buf);
			  sprintf(buf,"  Press  Enter  "); 
			  LCDPrintxy(1,2,0, buf);      // Display second	 	
			  int cal7_cnt;
               if(!ENC_SW)
              {       
                    for(cal7_cnt=60;cal7_cnt>0;cal7_cnt--)
                    {
                        __delay_ms(1000); 
                        sprintf(buf,"   pH 7  Cal.   "); 
                        LCDPrintxy(1,1,0, buf);
                        sprintf(buf," Time Left %d ",cal7_cnt); 
                        LCDPrintxy(1,2,0, buf);      // Display second
                    }
                    Eeprom_WriteWord(4,(int)(pH_ADC));              
                   __delay_ms(10);
                   Eeprom_WriteWord(4,(int)(pH_ADC));             
                   __delay_ms(10);  
                  pH7_cal = pH_ADC;
              }
        }//pH 7 Calibration


