koson/hydroponics/pH_Controller-master/pH_Controller-master/Firmware/pHDoser/dspic30_c_template_1.X/main.c
	if(POSCNT >=32 && POSCNT <= 35)	// debug monitoring
	{ 
        debug_mode = 1;
      sprintf(buf,"   Debugging    "); 
      LCDPrintxy(1,1,0, buf);
	  sprintf(buf,"ADC=%1.1f %02d:%02d   ",pH_ADC,ph_minute,ph_second); 
	  LCDPrintxy(1,2,0, buf);
	}
	if(POSCNT >=36 & POSCNT <= 39)	// Feed count
	{ 	
      sprintf(buf," pH Feed count  "); 
      LCDPrintxy(1,1,0, buf);
	  sprintf(buf,"   %04d  ml     ",(int)pH_FeedCount);
	  LCDPrintxy(1,2,0, buf);      // Display second	  	
	  
      if(!ENC_SW)
          pH_FeedCount = 0;
	}
	if(POSCNT >=40 && POSCNT <= 43)	// Pump Overide
	{
      sprintf(buf," Pump  Overide  "); 
      LCDPrintxy(1,1,0, buf);
	  sprintf(buf,"  PUSH TO ON    "); 
	  LCDPrintxy(1,2,0, buf);    
	 		
	  if(ENC_SW)
    	RY1 = 0; // Relay 1 ON
	  else if(!ENC_SW)
		RY1 = 1; // Relay 1 OFF
    }
        
        if(POSCNT > 45)
        {
            POSCNT = 0;
        }
   
    }

    return (EXIT_SUCCESS);
}

/*********************************/
/* Initial UART for dsPIC30F4011 */
/* 9600,N,8,1 / 117.9648MHz Fosc */
/*********************************/
void init_uart()
{		  
  CloseUART1();												// Disable UART1 Before New Config
  CloseUART2();												// Disable UART1 Before New Config

  // Config UART1 Interrupt Control
  ConfigIntUART1(UART_RX_INT_DIS &							// ENABLE RX Interrupt
    		     UART_RX_INT_PR2 &							// RX Interrupt Priority = 2
    		     UART_TX_INT_DIS &
    		     UART_TX_INT_PR3 );
     		    
    		     
  // Open UART1 = Mode,Status,Baudrate              
  OpenUART1(UART_EN	&										// Enable UART(UART Mode)
            UART_IDLE_STOP &								// Disable UART in IDLE Mode 
 			UART_ALTRX_ALTTX & 								// Select U1TX=RC13,U1RX=RC14
            UART_DIS_WAKE &									// Disable Wake-Up
			UART_DIS_LOOPBACK &								// Disable Loop Back
			UART_DIS_ABAUD &								// Disable Auto Baudrate
  			UART_NO_PAR_8BIT &								// UART = 8 Bit, No Parity
 			UART_1STOPBIT,									// UART = 1 Stop Bit

	  		// Config UART1 Status
  			UART_INT_TX & 									// Select Interrupt After TX Complete
	 		UART_TX_PIN_NORMAL &							// Normal U1TX Mode
 			UART_TX_ENABLE &								// Enable U1TX
 	 		UART_INT_RX_CHAR &							// Flasg Set After RX Complete 
  			UART_ADR_DETECT_DIS &              				// Disable Check Address 
			UART_RX_OVERRUN_CLEAR,							// Clear Overrun Flag

  			// ET-BASE dsPIC30F4011 Hardware Board
  			// XTAL = 7.3728MHz
  			// Fosc = 7.3728 MHz x 16 = 117.9648 MHz
  			// Fcy(UART) = Fosc / 4 
  			//           = 117.9648 / 4 = 29.4912 MHz
  			// U1BRG = [Fcy/(16xBaud)]-1
  			//       = [29.4912 MHz / (16x9600)] - 1
  			//       = 191 = BFH			
  			15);											// ET-BASE dsPIC30F4011 UART Baudrate = 9600 BPS = 191 //  Buad Rate 19200 = 95  ,, Buadrate 38400 = 47 ,  Buadrate 115200 = 15
  			
}